{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "LlavaForConditionalGeneration",
    "parent_library": "transformers.models.llava.modeling_llava"
  },
  "base_model_name_or_path": "llava-hf/llava-1.5-7b-hf",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "up_proj",
    "o_proj",
    "linear_1",
    "q_proj",
    "v_proj",
    "k_proj",
    "down_proj",
    "linear_2",
    "gate_proj"
  ],
  "task_type": null,
  "use_dora": true,
  "use_rslora": false
}
